app/controllers/loanapps_controller.rb

SELECT * FROM "loanapps" WHERE ("loanapps"."id" = 1)
---
  def show
    @loanapp = Loanapp.find(params[:id])