app/controllers/memberapps_controller.rb

  def index
    @memberapps = Memberapp.all
---
SELECT * FROM "memberapps"

  def show
    @memberapp = Memberapp.find(params[:id])
---
SELECT * FROM "memberapps" WHERE ("memberapps"."id" = 1)

  def edit
    @memberapp = Memberapp.find(params[:id])
---
SELECT * FROM "memberapps" WHERE ("memberapps"."id" = 5)

  def create
    @memberapp = Memberapp.new(params[:memberapp])

    respond_to do |format|
      if @memberapp.save
---
INSERT INTO "memberapps" ("address", "city", "work_phone", "zip", "created_at", "updated_at", "recommended_name", "relationship", "recommendation", "home_phone", "cell_phone", "advertisement", "other", "last_name", "affiliation", "first_name", "middle_name", "state", "email_id") VALUES('dasfsdfsdf', 'sdfsdfsdf', '', 45455, '2010-09-09 19:20:57', '2010-09-09 19:20:57', '', '', 'affiliation', '901-124-4524', '', 'Taxi insider', 'Person, Don''t Know Name', 'asdfasfasdf', 'tryhrtyrty', 'sdfsdfsdf', '', 'dsfsdfsdf', 'dfgdfgdfg')